2022-08-14 19:06:47,655 [INFO]  * Running on http://127.0.0.1:5000 (Press CTRL+C to quit)
2022-08-14 19:07:02,956 [INFO] Главная страница запрошена
2022-08-14 19:07:02,970 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:02] "GET / HTTP/1.1" 200 -
2022-08-14 19:07:02,990 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:02] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 19:07:02,992 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:02] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:02,994 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:02] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:17,308 [INFO] Поиск постов запрошен
2022-08-14 19:07:17,314 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:17] "GET /search/?s=кадре HTTP/1.1" 200 -
2022-08-14 19:07:17,322 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:17] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 19:07:17,325 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:17] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:17,326 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:17] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:20,494 [INFO] Главная страница запрошена
2022-08-14 19:07:20,495 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:20] "GET / HTTP/1.1" 200 -
2022-08-14 19:07:20,499 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:20] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:20,499 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:20] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 19:07:20,500 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:20] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:20,506 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:20] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:20,506 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:20] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 19:07:20,507 [INFO] 127.0.0.1 - - [14/Aug/2022 19:07:20] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 19:29:44,901 [INFO]  * Running on http://127.0.0.1:5000 (Press CTRL+C to quit)
2022-08-14 19:30:21,158 [INFO]  * Running on http://127.0.0.1:5000 (Press CTRL+C to quit)
2022-08-14 19:31:24,976 [INFO] Главная страница запрошена
2022-08-14 19:31:24,986 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:24] "GET / HTTP/1.1" 200 -
2022-08-14 19:31:24,999 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:24] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 19:31:24,999 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:24] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 19:31:25,000 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:25] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 19:31:27,662 [INFO] Главная страница запрошена
2022-08-14 19:31:27,663 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "GET / HTTP/1.1" 200 -
2022-08-14 19:31:27,669 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 19:31:27,674 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 19:31:27,676 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 19:31:27,680 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 19:31:27,681 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 19:31:27,682 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 19:31:27,908 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:27] "[33mGET /add HTTP/1.1[0m" 404 -
2022-08-14 19:31:29,899 [INFO] Запрос /api/posts
2022-08-14 19:31:29,900 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:29] "GET /api/posts HTTP/1.1" 200 -
2022-08-14 19:31:45,756 [INFO] Запрос /api/posts 1
2022-08-14 19:31:45,756 [INFO] 127.0.0.1 - - [14/Aug/2022 19:31:45] "GET /api/posts/1 HTTP/1.1" 200 -
2022-08-14 19:32:56,767 [INFO]  * Running on http://127.0.0.1:5000 (Press CTRL+C to quit)
2022-08-14 19:33:00,146 [INFO] Запрос /api/posts 1
2022-08-14 19:33:00,147 [INFO] 127.0.0.1 - - [14/Aug/2022 19:33:00] "GET /api/posts/1 HTTP/1.1" 200 -
2022-08-14 19:33:02,824 [INFO] Запрос /api/posts 1
2022-08-14 19:33:02,824 [INFO] 127.0.0.1 - - [14/Aug/2022 19:33:02] "GET /api/posts/1 HTTP/1.1" 200 -
2022-08-14 19:41:37,861 [INFO] Запрос /api/posts 1
2022-08-14 19:41:37,867 [INFO] 127.0.0.1 - - [14/Aug/2022 19:41:37] "GET /api/posts/1 HTTP/1.1" 200 -
2022-08-14 19:52:10,849 [INFO] Запрос /api/posts
2022-08-14 19:52:10,863 [INFO] Запрос /api/posts 1
2022-08-14 19:52:48,473 [INFO] Запрос /api/posts
2022-08-14 19:52:48,475 [INFO] Запрос /api/posts 1
2022-08-14 19:53:32,790 [INFO] Запрос /api/posts
2022-08-14 19:53:32,805 [INFO] Запрос /api/posts 1
2022-08-14 19:54:00,667 [INFO] Запрос /api/posts
2022-08-14 19:54:00,681 [INFO] Запрос /api/posts 1
2022-08-14 19:54:28,154 [INFO] Запрос /api/posts
2022-08-14 19:54:28,156 [INFO] Запрос /api/posts 1
2022-08-14 19:58:01,754 [INFO] Запрос /api/posts
2022-08-14 19:58:01,757 [INFO] Запрос /api/posts 1
2022-08-14 19:58:35,290 [INFO] Запрос /api/posts
2022-08-14 19:58:35,293 [INFO] Запрос /api/posts 1
2022-08-14 20:03:34,846 [INFO] Запрос /api/posts
2022-08-14 20:03:34,862 [INFO] Запрос /api/posts 1
2022-08-14 20:05:17,897 [INFO] Запрос /api/posts
2022-08-14 20:05:17,900 [INFO] Запрос /api/posts 1
2022-08-14 20:14:43,448 [INFO] Запрос /api/posts
2022-08-14 20:14:43,451 [INFO] Запрос /api/posts 1
2022-08-14 20:14:52,825 [INFO] Запрос /api/posts
2022-08-14 20:14:52,828 [INFO] Запрос /api/posts 1
2022-08-14 20:21:24,234 [INFO]  * Running on http://127.0.0.1:5000 (Press CTRL+C to quit)
2022-08-14 20:21:25,601 [INFO] Главная страница запрошена
2022-08-14 20:21:25,604 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:25] "GET / HTTP/1.1" 200 -
2022-08-14 20:21:25,616 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:25] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 20:21:25,616 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:25] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 20:21:25,616 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:25] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 20:21:29,404 [INFO] Главная страница запрошена
2022-08-14 20:21:29,406 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "GET / HTTP/1.1" 200 -
2022-08-14 20:21:29,411 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 20:21:29,412 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 20:21:29,412 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 20:21:29,436 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "[36mGET /static/css/styles.min.css HTTP/1.1[0m" 304 -
2022-08-14 20:21:29,436 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "[36mGET /static/img/eye.png HTTP/1.1[0m" 304 -
2022-08-14 20:21:29,436 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "[36mGET /static/img/bookmark.png HTTP/1.1[0m" 304 -
2022-08-14 20:21:29,659 [INFO] Запрос /api/posts 1
2022-08-14 20:21:29,660 [INFO] 127.0.0.1 - - [14/Aug/2022 20:21:29] "GET /api/posts/1 HTTP/1.1" 200 -